
# Классификация методом к-средних

# Шаг № 1 Найдём оптимальное число кластеров


#  Способ № 1

wss <- (nrow(x.data)-1)*sum(apply(x.data,2,var))
for (i in 2:15) wss[i] <- kmeans(x.data, 
                                 centers=i)$tot.withinss
plot(1:15, wss, type="b", xlab="Number of Clusters",
     ylab="Within groups sum of squares") 

# Способ № 2

#  Определение числа кластеров

library(NbClust)

Best <- NbClust(x.data, distance = "euclidean", 
                min.nc = 2, max.nc = 15, method = "ward.D", index = "alllong")

#---------------------------------------------------------------------

# Шаг № 2

# метод k-средних
summ.1 <- kmeans(x.data,centers = 3)

# К каким кластерам принадлежат объекты?
summ.1$cluster
#   [1] 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 2 1 1 1 1 1 1 1 2 1 1 1 1 1 2 2 2 2 2 2 2 2 2
#   [39] 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 3 3 3 3 3 3 3 3
#   [77] 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3

#  Координаты центров кластеров
t(summ.1$centers)
# 1         2         3
# x1  0.4215107 0.3872946 0.7318145
# x2  0.5215058 0.4391047 0.5732427
# x3  0.4917364 0.4984211 0.5560786
# x4  0.3055203 0.5501217 0.6611518
# x5  0.2395657 0.6163741 0.6037953
# x6  0.7492464 0.4572693 0.2597020
# x7  0.5195441 0.4059107 0.6184091
# x8  0.5033803 0.4179467 0.5424169
# x9  0.3449523 0.4517956 0.7057470
# x10 0.4897068 0.5523900 0.4156279
# x11 0.6139418 0.5415394 0.2998844
# x12 0.5694406 0.3893881 0.5393825
# x13 0.2800697 0.4858132 0.7688950
# x14 0.3860622 0.6539599 0.3320825
# x16 0.4249529 0.4385820 0.6682153
# x17 0.5470811 0.4395599 0.5437135
# x18 0.3452195 0.4727310 0.6845209
# x19 0.3748716 0.4999651 0.6487823
# x21 0.3568124 0.6633398 0.3858037
# x22 0.5446907 0.6142620 0.2596572
# x23 0.4701973 0.5020580 0.5019250
# x24 0.6574218 0.4302296 0.4123776

#  Сумма квадратов расстояний от объектов кластера до центра кластера
summ.1$withinss
#  [1] 15.77605 23.36790 16.38127


#  Сумма элементов предыдущего вектора
summ.1$tot.withinss


summ.1$totss
#  то же самое, что и 
#  sum(33*(apply(x.data, 2, sd))^2)


#  Смотрим help
summ.1$tot.betweenss


#  Размеры кластеров
summ.1$size
#  [1] 27 41 23

